Revit 2027 API
PerformanceAdviser.AddRule Method
 Adds a performance adviser rule to the list of rules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddRule(
	PerformanceAdviserRuleId id,
	IPerformanceAdviserRule rule
)
Public Sub AddRule (
	id As PerformanceAdviserRuleId,
	rule As IPerformanceAdviserRule
)
public:
void AddRule(
	PerformanceAdviserRuleId^ id,
	IPerformanceAdviserRule^ rule
)
member AddRule :
        id : PerformanceAdviserRuleId *
        rule : IPerformanceAdviserRule -> unit
Parameters
id PerformanceAdviserRuleId
 An id of the rule to be added to the list of rules.
rule IPerformanceAdviserRule
 The rule to be added
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace